src/cf/DataProcessors/desШаблонОбработкиОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>desШаблонОбработкиОчереди</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.desДействияПриОбмене</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.desНастройкиДействийПриОбмене</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/desОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>desОчередьВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщенияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ПродажиПоЭкспозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиПоЭкспозиции</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.вогРаспределительныеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Панель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогПанели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПодразделенияТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ПодразделенияТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕстьБрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/вогДвиженияУС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>вогДвиженияУС</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиПоЭкспозиции</xr:Item>
				<xr:Item>AccumulationRegister.вогЗатратыНаРаспродажу</xr:Item>
				<xr:Item>AccumulationRegister.вогПродажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Не переносить в объединенные решения</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПоУмолчанию</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСПоУмолчанию</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ОГРН</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДляОтчетаГенеральномуДиректору</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокДляОтчетаГенеральномуДиректору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/desШаблонОбработкиОчереди/Ext/ObjectModule.bsl
Перем ОбщиеПараметры Экспорт;

Перем ПараметрыОбработки Экспорт;

//+++ Терпогосян Д.Б. [20.09.2021 15:06:54] № CRM-1219
Перем ПодразделениеЮГ_КМВ Экспорт; 
Перем ПодразделениеЮГ_Ростов Экспорт; 
Перем соТТГ_Подразделение Экспорт; 
//--- Терпогосян Д.Б. [20.09.2021 15:06:58] № CRM-1219 


Функция ВыполнитьОбмен(ПараметрыОбработчика) Экспорт
	
	ПараметрыДействия 			= ПараметрыОбработчика.ХранилищеПараметры.Получить();
	
	//СхемаКомпоновкиДанных 		= ПараметрыОбработчика.ХранилищеСхемаИсточникаДанных.Получить();
	//		
	//НастройкиКомпоновкиДанных	= ПараметрыОбработчика.ХранилищеКомпоновщикНастроек.Получить();
	
	ИдентификаторНастройки = ПараметрыОбработчика.НастройкаДействий.ИдентификаторНастройки;
	
	ИмяОчереди	= ПараметрыДействия.ИмяОчереди;	
	
	
	НачатьТранзакцию();
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.desОчередьВходящихСообщений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторНастройки.Установить(ИдентификаторНастройки);
		НаборЗаписей.Отбор.ИмяОчереди.Установить(ИмяОчереди);
		
		Если ПараметрыДействия.Свойство("ИдентификаторСообщения") Тогда
			НаборЗаписей.Отбор.Идентификатор.Установить(ПараметрыДействия.ИдентификаторСообщения);	
		КонецЕсли; 
		
		НаборЗаписей.Прочитать();
		
		ТаблицаОбластиБлокировки = НаборЗаписей.Выгрузить();
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.desОчередьВходящихСообщений");
		
		ЭлементБлокировки.ИсточникДанных = ТаблицаОбластиБлокировки;
		
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторНастройки",ИдентификаторНастройки);
		ЭлементБлокировки.УстановитьЗначение("ИмяОчереди",ИмяОчереди);
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Идентификатор","Идентификатор");
		
		Блокировка.Заблокировать();
		
		Для каждого Сообщения Из ТаблицаОбластиБлокировки Цикл
			
			СтрокаСообщение = Сообщения.Хранилище.Получить();	
			
			ЧтениеJSON = Новый ЧтениеJSON;
			
			ЧтениеJSON.УстановитьСтроку(СтрокаСообщение);
			
			СтруктураСообщения	= ПрочитатьJSON(ЧтениеJSON);
			
			ЧтениеJSON.Закрыть();
			
			МенеджерСообщения = РегистрыСведений.desОчередьВходящихСообщений.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МенеджерСообщения,Сообщения,"ИдентификаторНастройки,ИмяОчереди,Идентификатор");
			
			МенеджерСообщения.Прочитать();
			
			ТекстОшибки = "";
			
			ОбработатьСообщениеОчереди(СтруктураСообщения,ТекстОшибки);
			
			Если ПустаяСтрока(ТекстОшибки) Тогда
				МенеджерСообщения.Удалить();
			Иначе 
				МенеджерСообщения.ТекстСообщенияОбОшибке	= ТекстОшибки;
				МенеджерСообщения.Записать();
			КонецЕсли; 
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение    
		
		ОтменитьТранзакцию();
		
		МенеджерСообщения.ТекстСообщенияОбОшибке	= ТекстОшибки;
		МенеджерСообщения.Записать();

	КонецПопытки;
	
	
КонецФункции

Процедура ОбработатьСообщениеОчереди(СтруктураСообщения,ТекстОшибки)
	
	Период = ПрочитатьДатуJSON(СтруктураСообщения.period,ФорматДатыJSON.ISO); 
	
	Организация  	= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураСообщения.org_id));
	
	Подразделение 	= вогИнтеграцияСУчетнойСистемой.ПолучитьПодразделениеПоОрганизации(Организация); 
	
	Если Не ОбщегоНазначения.СсылкаСуществует(Подразделение) Тогда
		
		ТекстОшибки = ТекстОшибки + Символы.ПС + +"Не найдено подразделение по ID " + СтруктураСообщения.org_id; 
		
	КонецЕсли;
	
	ТТГ = Справочники.вогТорговыеТочки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураСообщения.ttg_id));
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ТТГ) И СтруктураСообщения.sales.Количество() Тогда
		
		ТекстОшибки = ТекстОшибки + Символы.ПС + "Не найдена ТТГ " + СтруктураСообщения.ttg_name +  "(" + СтруктураСообщения.ttg_id + ")"; 
		
	КонецЕсли;
	
	//+++ Терпогосян Д.Б. [20.09.2021 14:37:38] № CRM-1219
	Если ПустаяСтрока(ТекстОшибки) и Подразделение = ПодразделениеЮГ_КМВ Тогда 
		Подразделение = ПолучитьПодразделениеПоТорговойТочке(ТТГ);
		Если Подразделение = Неопределено Тогда 
			ТекстОшибки = ТекстОшибки + Символы.ПС + "Не найдено подразделение по ТТГ " + СтруктураСообщения.ttg_name +  "(" + СтруктураСообщения.ttg_id + ")"; 
		КонецЕсли; 	 
	КонецЕсли; 
	//--- Терпогосян Д.Б. [20.09.2021 14:37:38] № CRM-1219 
	
	Регистратор = Документы.вогДвиженияУС.ПустаяСсылка();
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиПоЭкспозиции.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ПродажиПоЭкспозиции КАК ПродажиПоЭкспозиции
		|ГДЕ
		|	ПродажиПоЭкспозиции.Период = &Период
		|	И ПродажиПоЭкспозиции.Подразделение = &Подразделение
		|	И ПродажиПоЭкспозиции.ТорговаяТочка = &ТорговаяТочка";
		
		Запрос.УстановитьПараметр("Период",Период);
		Запрос.УстановитьПараметр("Подразделение",Подразделение);
		Запрос.УстановитьПараметр("ТорговаяТочка",ТТГ);
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Регистратор = Выборка.Регистратор;
			
		Иначе 
			
			Если СтруктураСообщения.sales.Количество() Тогда
				
				вогДвиженияУСОбъект = Документы.вогДвиженияУС.СоздатьДокумент();
				вогДвиженияУСОбъект.Источник	= "Продажи по экспозиции " + Формат(Период,"ДФ=MM.yy");
				вогДвиженияУСОбъект.Комментарий = " " + Подразделение + ";" + ТТГ;
				вогДвиженияУСОбъект.Дата		= Период;
				вогДвиженияУСОбъект.Записать();
				
				Регистратор = вогДвиженияУСОбъект.Ссылка;
				
			КонецЕсли; 
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Регистратор) Тогда
			
			НаборЗаписей = РегистрыНакопления.ПродажиПоЭкспозиции.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			
			НаборЗаписей.Прочитать();
			
			НаборЗаписей.Очистить();
			
			Для каждого СтрокаПродажи  Из СтруктураСообщения.sales Цикл
				
				ПанельСсылка = Справочники.вогПанели.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаПродажи.panel.id));
				
				Если Не ОбщегоНазначения.СсылкаСуществует(ПанельСсылка) Тогда
					
					ПанельОбъект = Справочники.вогПанели.СоздатьЭлемент();
					ПанельОбъект.УстановитьСсылкуНового(ПанельСсылка);
					ПанельОбъект.Наименование	= СтрокаПродажи.panel.name;
					Попытка
						ПанельОбъект.Записать();
					Исключение				
						ТекстОшибки = ТекстОшибки + Символы.ПС + ОписаниеОшибки();				
					КонецПопытки;
					
					
					ПанельСсылка = ПанельОбъект.Ссылка;
					
				КонецЕсли; 
				
				НоваяСтрока =  НаборЗаписей.Добавить();
				НоваяСтрока.Период			= Период;
				НоваяСтрока.Подразделение	= Подразделение;
				НоваяСтрока.ТорговаяТочка	= ТТГ;
				НоваяСтрока.Панель			= ПанельСсылка;
				НоваяСтрока.Количество		= СтрокаПродажи.quantity;
				
				
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
		КонецЕсли; 
		
		
		
	КонецЕсли; 
	
	
КонецПроцедуры
 
Функция  ПолучитьСоставПараметров() Экспорт
	
	СтруктураПараметров = Новый Структура();
	
	СтруктураПараметров.Вставить("ПараметрыОбработки",ПараметрыОбработки);
	
	
	Возврат СтруктураПараметров;

КонецФункции

//+++ Терпогосян Д.Б. [20.09.2021 15:06:07] № CRM-1219
Функция ПолучитьПодразделениеПоТорговойТочке(ТТГ) Экспорт
	Если соТТГ_Подразделение = Неопределено Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделенияТорговыхТочек.ТорговаяТочка КАК ТорговаяТочка,
		|	ПодразделенияТорговыхТочек.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.ПодразделенияТорговыхТочек КАК ПодразделенияТорговыхТочек
		|ГДЕ
		|	ПодразделенияТорговыхТочек.Направление = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Плитка)
		|	И ПодразделенияТорговыхТочек.Подразделение В(&Подразделения)";
		
		Подразделения = Новый Массив; 
		Подразделения.Добавить(ПодразделениеЮГ_КМВ); 
		Подразделения.Добавить(ПодразделениеЮГ_Ростов); 
		Запрос.УстановитьПараметр("Подразделения", Подразделения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		соТТГ_Подразделение = Новый Соответствие; 
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			соТТГ_Подразделение.Вставить(ВыборкаДетальныеЗаписи.ТорговаяТочка, ВыборкаДетальныеЗаписи.Подразделение); 
		КонецЦикла;
	КонецЕсли; 
	Возврат соТТГ_Подразделение.Получить(ТТГ)
КонецФункции 

ПодразделениеЮГ_КМВ = Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("3000815c-66e6-11e3-9235-00155d66c603")); 
ПодразделениеЮГ_Ростов = Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("9f82aafb-3b61-11e9-b0ca-005056bcd3e3")); 
//--- Терпогосян Д.Б. [20.09.2021 15:06:08] № CRM-1219 

 ПараметрыОбработки = Новый Структура; 
 
 ПараметрыОбработки.Вставить("ИмяОчереди","");
